src/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Comment>Банковские счета</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ПодразделенияКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Вид банковского счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>Банк, в котором открыт счет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанковРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк для случая непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанковРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она является целым числом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/БанковскиеСчета/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Банковские счета"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура предназначена для проверки правильности указания номеров корреспондентских счетов и БИК,
//  так как вероятность ошибки при вводе 20-разрядного номера велика, и такая проверка будет удобным
//  дополнительным сервисом. Правильность указания банковских реквизитов проверяется по следующим критериям:
//   - длина номера счета должна быть 20 символов;
//   - длина БИК должна быть 9 символов;
//   - БИК должен быть числом (проверять номер счета на число нельзя, так как в случае использования клиринговой
//      валюты в 6-м разряде номера может стоять символ (хотя это редкий случай));
//   - номера счетов и БИК совместно проверяются по алгоритму проверки правильности расчета контрольного ключа.
//   Если какое-либо из этих условий не выполняется, выдается сообщение в окно сообщений, но информация
//   о расчетном счете все равно записывается в справочник.
//
Процедура ПроверкаСчета(Объект) Экспорт
	
	ПроверятьКлючРасчСчета=1;
	Если ПустаяСтрока(СокрЛП(Объект.НомерСчета)) Тогда
		ВывестиСообщение(НСтр("ru='Не указан номер счета.'"), Объект);
		ПроверятьКлючРасчСчета=0;
	ИначеЕсли СтрДлина(СокрЛП(Объект.НомерСчета)) <> 20 Тогда
		// Длина номера счета должна быть равна 20
		ВывестиСообщение(НСтр("ru='Возможно, номер счета указан неверно.'"), Объект);
		ПроверятьКлючРасчСчета=0;
	КонецЕсли;
	
	// Если указан БИК, начинаем проверять его
	Если НЕ ЗначениеЗаполнено(Объект.Банк) Тогда
		ВывестиСообщение(НСтр("ru='Не указан банк, в котором открыт расчетный счет.'"), Объект);
		ПроверятьКлючРасчСчета=0;
	Иначе
		Попытка
			ЧислоКод = Число(Объект.Банк.Код);
		Исключение
			ЧислоКод = 0;
		КонецПопытки;
		Если (СтрДлина(СокрЛП(Объект.Банк.Код)) <> 9) ИЛИ (ЧислоКод = 0) Тогда
		ВывестиСообщение(НСтр("ru='Возможно, БИК банка, в котором открыт расчетный счет, указан неверно.'"), Объект);
		ПроверятьКлючКоррСчета=0;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьКлючРасчСчета=1 Тогда
		// Для проверки к номеру счета слева добавляются 3 последние цифры БИК
		Если (НЕ ПроверкаНомераСчета(Прав(Объект.Банк.Код, 3)+Объект.НомерСчета)) И (НЕ ПроверкаНомераСчета("0"+Сред(Объект.Банк.Код, 5, 2 )+Объект.НомерСчета)) Тогда
			ВывестиСообщение(НСтр("ru='Возможно, номер счета или БИК банка указаны неверно.'"), Объект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПроверкаСчета()

// Функция проверяет наличие букв в номере счета
//	Параметры:          
//  	НомерСчета - Номер проверяемого счета
//	Возвращаемое значение:
//  	Истина - если в номере счета есть буквы
//  	Ложь - если счет указан верно.
//
Функция ЕстьБуквы(НомерСчета)
	
	НомерСчета = СокрЛП(НомерСчета);
	Если СтрДлина(НомерСчета) > 0 Тогда
		Для Сч=1 По СтрДлина(НомерСчета) Цикл
			Буква = НРег(Сред(НомерСчета,Сч,1));
			Если СтрНайти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя", Буква)
				ИЛИ СтрНайти("abcdefghijklmnopqrstuvwxyz", Буква) Тогда
					Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции // ЕстьБуквы()

// Функция проверяет правильность указания номера расчетного счета по алгоритму проверки правильности 
//  расчета контрольного ключа.
//	Параметры:          
//  	НомерСчета - Номер проверяемого счета
//	Возвращаемое значение:
//  	Истина - если все нормально
//  	Ложь - если счет указан неверно.
//
Функция ПроверкаНомераСчета(НомерСчет)
	
	Перем Поз; // счетчик цикла
	
	// Весовые коэффициенты
	Вес="71371371371371371371371";
	КонтрСумма=0;
	
	Если ЕстьБуквы(НомерСчет) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	Для Поз=1 По 23 Цикл
		Произв=Число(Сред(НомерСчет, Поз, 1))*Число(Сред(Вес, Поз, 1));
		МладшийРазряд=Число(Прав(Строка(Произв),1));
		КонтрСумма=КонтрСумма+МладшийРазряд;
	КонецЦикла;
	Проверка = НЕ Булево(КонтрСумма/10-Цел(КонтрСумма/10));
	Возврат Проверка;
	
КонецФункции // ПроверкаНомераСчета()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("НомерСчета");
	ОбязательныеРеквизиты.Добавить("ВидСчета");
	ОбязательныеРеквизиты.Добавить("Банк");
	ОбязательныеРеквизиты.Добавить("ВалютаДенежныхСредств");
	//Если ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.Организации") Тогда
	//	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	//КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВалютаДенежныхСредств");
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Возвращает наименование объекта банковский счет
// на основании реквизитов номер счета, банк и валюта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.НомерСчета)
		И ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств)
		И ЗначениеЗаполнено(Объект.Банк) Тогда
		
		Наименование = "р/с "
			+ СокрЛП(Объект.НомерСчета)
			+ " ("
			+ СокрЛП(Объект.ВалютаДенежныхСредств.Наименование)
			+ ") в "
			+ СокрЛП(Объект.Банк.Наименование)
			+", БИК:"
			+ СокрЛП(Объект.Банк.Код);
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()


// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	ДопУсловие = Новый Массив;
	
	СписокТиповПараметра = Новый Массив;
	СписокТиповПараметра.Добавить(Тип("Массив"));
	СписокТиповПараметра.Добавить(Тип("СписокЗначений"));
	СписокТиповПараметра.Добавить(Тип("ФиксированныйМассив"));
	
	Для Каждого ТекущийОтбор Из Параметры.Отбор Цикл
		
		Если СписокТиповПараметра.Найти(ТипЗнч(ТекущийОтбор.Значение)) = Неопределено Тогда
			ВидСравненияОтбора = "=";
			ИмяПараметра = СтрШаблон("&%1", ТекущийОтбор.Ключ);
		Иначе
			ВидСравненияОтбора = "В";
			ИмяПараметра = СтрШаблон("(&%1)", ТекущийОтбор.Ключ);
		КонецЕсли;
		
		ДопУсловие.Добавить(СтрШаблон("%1 %2 %3", ТекущийОтбор.Ключ, ВидСравненияОтбора, ИмяПараметра));
		Запрос.УстановитьПараметр(ТекущийОтбор.Ключ, ТекущийОтбор.Значение);
	КонецЦикла;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаУсловия = СтрСоединить(ДопУсловие, " И БанковскиеСчета.");
	
	Если СтрДлина(СтрокаУсловия) > 0 Тогда
		СтрокаУсловия = " И " + СтрокаУсловия;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	БанковскиеСчета.Наименование КАК Наименование,
	               |	БанковскиеСчета.Код КАК Код,
	               |	БанковскиеСчета.НомерСчета КАК НомерСчета,
	               |	БанковскиеСчета.Владелец КАК Владелец,
	               |	БанковскиеСчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.БанковскиеСчета КАК БанковскиеСчета
	               |ГДЕ
	               |	БанковскиеСчета.Наименование ПОДОБНО &СтрокаПоиска %ДопУсловие%";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%ДопУсловие%", СтрокаУсловия);
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Параметры.СтрокаПоиска + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Представление = СтрШаблон("%1 (%2) (%3) (%4)", Выборка.Наименование, СокрЛП(Выборка.Код), СокрЛП(Выборка.НомерСчета), Выборка.Владелец);
		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПолученияДанныхВыбора()

#КонецОбласти
